УТ_для_edt.РасширениеСмарт/src/Catalogs/ХарактеристикиНоменклатуры/ХарактеристикиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ХарактеристикиНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Товар</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>МногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Работа</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Набор</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Enums/ВариантыИспользованияХарактеристикНоменклатуры/ВариантыИспользованияХарактеристикНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВариантыИспользованияХарактеристикНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ОбщиеДляВидаНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныеДляНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОбщиеСДругимВидомНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Catalogs/ХарактеристикиНоменклатуры/ManagerModule.bsl
//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования.
&ИзменениеИКонтроль("ИспользованиеЭлементов")
Функция смарт_ИспользованиеЭлементов(ПереданныйОбъект, РеквизитыВидаНоменклатуры)

	ИспользованиеЭлементов = Новый Структура;

	#Область НастройкаПоВидуНоменклатуры

	НастройкиРеквизитовПоВидуНоменклатуры = Справочники.Номенклатура.ТаблицаНастроекРеквизитов(РеквизитыВидаНоменклатуры.Ссылка,
	РеквизитыВидаНоменклатуры.ТипНоменклатуры,
	РеквизитыВидаНоменклатуры.ОсобенностьУчета,
	РеквизитыВидаНоменклатуры.ИспользованиеХарактеристик,
	Ложь,
	"ХарактеристикиНоменклатуры");

	Для Каждого СтрТабл Из НастройкиРеквизитовПоВидуНоменклатуры Цикл

		ИмяРеквизита = СтрТабл.ИмяРеквизита; 
		
		#Вставка
		//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования.
		Если ИмяРеквизита = "смартСрокГарантии" Тогда
			Продолжить;
		КонецЕсли;
		//-- #1944 смарт: Мосолов 26.07.2024 
		#КонецВставки

		Если СтрТабл.ЭтоДопРеквизит Тогда
			ИмяЭлементаФормы = "ДополнительныйРеквизитЗначение_"
			+ СтрЗаменить(?(СтрТабл.ЭтоОбщийРеквизит,
			ВРег(Строка(СтрТабл.Набор.УникальныйИдентификатор())),
			ВРег(Строка(СтрТабл.НаборСвойств.УникальныйИдентификатор()))),
			"-",
			"x")
			+ "_"
			+ СтрЗаменить(ВРег(Строка(СтрТабл.Свойство.УникальныйИдентификатор())), "-", "x");

			ИспользованиеЭлементов.Вставить(ИмяЭлементаФормы, СтрТабл.Использование 
			И Справочники.Номенклатура.ВидимостьРеквизита(СтрТабл,
			ИмяРеквизита,
			Ложь,
			СтрТабл));
		Иначе
			ИспользованиеЭлементов.Вставить(ИмяРеквизита, СтрТабл.Использование
			И (Справочники.Номенклатура.ВидимостьРеквизита(ИмяРеквизита,
			ИмяРеквизита,
			Ложь,
			СтрТабл)));
		КонецЕсли;

	КонецЦикла;

	#КонецОбласти

	ИспользованиеЭлементов.Вставить("ГиперссылкаПерейтиСоставНабора",
	ПравоДоступа("Просмотр", Метаданные.Справочники.ВариантыКомплектацииНоменклатуры)
	И РеквизитыВидаНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор
	И РеквизитыВидаНоменклатуры.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры);

	Возврат ИспользованиеЭлементов;

КонецФункции //-- #1944 смарт: Мосолов 26.07.2024
